{
    "theSpy": "المستخبي",
    "start": "بدأ",
    "gameIdea": "فكرة اللعبة",
    "gameDescription": "فكرة اللعبة باختصار أن لما الجيم يبدأ الموبايل بيمر على كل لاعب وكل اللاعبين بيطلع لهم كلمة واحدة عدا لاعب واحد بيطلع له حاجة مختلفة وكل اللاعبين بيحاولوا يطلعوا مين المستخبي ده وهو بيحاول يندمج معاهم ويخلي ما حدش يشك فيه",
    "selectMode": "اختار المود",
    "select": "اختار",
    "classicModeTitle": "الكلاسيك",
    "classicModeDescription": "اللي بيظهر للمستخبي هو \n( أنت المستخبي )\n يعني بيكون عارف إنه هو المستخبي وبيحاول يندمج",
    "blindModeTitle": "العمياني",
    "blindModeDescription": "في المود ده اللي بيظهر للمستخبي هي كلمة مختلفة عن الباقي. يعني ما حدش بيكون عارف إنه هو المستخبي ولا لأ",
    "amongUs": "مبينا غريب",
    "classicDouble": "الدبل كلاسيك",
    "blindDouble": "الدبل عمياني",
    "Duo": "الكلاسيك الثنائي",
    "addPlayer": "إضافة لاعب جديد",
    "noNameValidate": "ما ينفعش تضيف لاعب فاضي (:",
    "nameRegisteredValidate": "اللاعب موجود بالفعل!",
    "errorOccured": "حدث خطأ!",
    "playersAlertContent": "ما ينفعش أقل من",
    "back": "رجوع",
    "ask": "اسأل",
    "askNotDirectly": "بشكل غير مباشر عن الكلمة",
    "nowYouCanAskOrVote": "دلوقتي تقدروا تصوتوا أو تسألوا تاني",
    "reAsk": "إعادة الأسئلة",
    "vote": "تصويت",
    "giveMobileTo": "إدي الموبايل لـ",
    "wordRevealText": "اضغط عرض عشان تشوف الكلمة وما تخليش حد يشوفها",
    "show": "عرض",
    "next": "التالي",
    "hide": "استخبى!",
    "hideAll": "استخبوا!",
    "players": "لاعبين",
    "theSpyIs": "المستخبي هو",
    "results": "النتائج",
    "rightWord": "الكلمة الصحيحة :",
    "replay": "ابدأ من جديد",
    "settings": "الإعدادات",
    "leaderboard": "قائمة المستخبيين",
    "changeLanguage": "تغيير اللغة",
    "delete": "حذف",
    "food": "أكلات",
    "foodList": "كشري، محشي، ملوخية، شاورما، بيتزا، برجر، فول، طعمية، كبسة، مقلوبة، مشاوي، كباب، كفتة، سمك، جمبري، سوشي، شوربة عدس، فطير مشلتت، عيش باللحم، بطاطس مقلية، دجاج مشوي، بانيه، مكرونة بشاميل، صينية بطاطس، أرز معمر، عكاوي، بامية، مسقعة، بيض، جبنة، عصير مانجو، عصير فراولة، لبن رايب، مهلبية، أرز باللبن، كنافة، قطايف، جلاش، بلح الشام، بسبوسة، تشيز كيك، دونات، كيك، تورتة، كريم كراميل، كرواسون، باتيه، سمبوسك، سبرنج رول",
    "cloths": "ملابس",
    "clothsList": "قميص، بنطلون، تي شيرت، جاكيت، بلوفر، شورت، بدلة، فستان، تنورة، عباية، كوفية، طاقية، شراب، حزام، حذاء، شبشب، بيجامة، نقاب، طرحة، بودي، جاكيت جينز، هودي، بالطو، قميص رسمي، تي شيرت بولو، بنطلون جينز، بنطلون قماش، تي شيرت رياضي، حذاء جلدي، حذاء بكعب عالي، سنيكرز، بوت، فروة، بدلة رسمية، تي شيرت بكم، تي شيرت نصف كم، جاكيت جلدي، طقم رياضي، تي شيرت مطبوع، جاكيت شتوي، كاب، جوانتي، روب استحمام، بيجامة شتوية، طقم بيجامة، جاكيت مطري، معطف، وشاح، سترة، جلباب، قفازات، قبعة",
    "animals": "حيوانات",
    "animalsList": "أسد، نمر، فهد، ذئب، كلب، قط، دب، ثعلب، زرافة، فيل، غزال، ظبي، تمساح، سلحفاة، أرنب، قرد، دلفين، حوت، قرش، بطريق، نسر، صقر، بومة، غراب، عصفور، كناري، ببغاء، هدهد، نملة، نحلة، ذبابة، بعوضة، جمل، حصان، حمار، بقرة، ماعز، خروف، ديك، دجاجة، بطة، وزة، سمكة، نجمة البحر، قنديل البحر، حصان البحر، عقرب، ثعبان، ضفدع، ورل",
    "countries": "بلدان",
    "countriesList": "مصر، السعودية، الإمارات، الكويت، قطر، الأردن، سوريا، لبنان، فلسطين، العراق، ليبيا، تونس، الجزائر، المغرب، اليمن، البحرين، عمان، السودان، تركيا، إيران، الهند، باكستان، الصين، اليابان، كوريا، فرنسا، ألمانيا، إيطاليا، إسبانيا، البرتغال، هولندا، بلجيكا، السويد، النرويج، فنلندا، سويسرا، أمريكا، كندا، المكسيك، البرازيل، الأرجنتين، أستراليا، نيوزيلندا، جنوب أفريقيا، نيجيريا، كينيا، أوغندا، ماليزيا، إندونيسيا، تايلاند",
    "films": "أفلام",
    "filmsList": "تايتانيك، أفاتار، بداية، بين النجوم، العراب، المصارع، فارس الظلام، الجوكر، خيال رخيص، نادي القتال، فورست غامب، الماتريكس، الخلاص من شوشانك، المنتقمون، الرجل الحديدي، الرجل العنكبوت، النمر الأسود، دكتور سترينج، فيلم الملكة، حكاية لعبة، فوق، كوكو، موانا، سيارات، البحث عن نيمو، الملك الأسد، علاء الدين، الجميلة والوحش، الخارقون، شريك، مدغشقر، زوتوبيا، راتاتوي، من الداخل للخارج، صداع الكحول، السعي للسعادة، ديدبول، لوغان، جون ويك، قراصنة الكاريبي، العائد، لا لا لاند، المفكرة، الشفق، ألعاب الجوع، المختلفة، الآن تراني، العظمة، تينيت",
    "sports": "رياضة",
    "sportsList": "كرة القدم، كرة السلة، كرة الطائرة، كرة اليد، السباحة، التنس، كرة الطاولة، الكاراتيه، الجودو، المصارعة، الملاكمة، رفع الأثقال، ألعاب القوى، الجمباز، الهوكي، الرغبي، البيسبول، الكريكت، الاسكواش، البولينج، ركوب الخيل، ركوب الدراجات، القفز بالمظلات، التزحلق على الجليد، الغوص، التجديف، التزحلق على الماء، الباركور، الكونغ فو، التايكوندو، ركوب الأمواج، السباق، فورمولا واحد، الرماية، الشطرنج، الدراجات الجبلية، اليوجا، الجمباز الإيقاعي، الزومبا، بيلاتس، الرماية بالقوس، السنوكر، الكيك بوكسينج، الهوكي الجليدي، السباحة التوقيعية، البولو، التنس الأرضي، المشي الرياضي، الركض، الرماية بالبندقية",
    "football": "كرة القدم",
    "footballList": "ليونيل ميسي، كريستيانو رونالدو، نيمار جونيور، محمد صلاح، رياض محرز، كيليان مبابي، إيرلينغ هالاند، كيفن دي بروين، روبرت ليفاندوفسكي، كريم بنزيما، لوكا مودريتش، سيرجيو راموس، مانشستر سيتي، ريال مدريد، برشلونة، ليفربول، الدوري الإنجليزي الممتاز، الدوري الإسباني، دوري أبطال أوروبا، كأس العالم، كأس الأمم الأفريقية، كأس أوروبا، الكرة الذهبية، الحذاء الذهبي، الحكم، حارس المرمى، خط الوسط، المدافع، المهاجم، ضربة الجزاء، ركلة حرة، ركنية، التسلل، البطاقة الحمراء، البطاقة الصفراء، الأهداف، الشباك، العارضة، القائم، التمريرة، المراوغة، التسديد، رأسية، العشب، الملعب، شارة الكابتن، الاحتياطي، الهتافات، الجماهير، الاستاد، الشوط الأول، الشوط الثاني، الوقت الإضافي، ركلات الترجيح",
    "cities": "مدن",
    "citiesList": "القاهرة، الرياض، دبي، الدوحة، بيروت، عمان، دمشق، بغداد، الخرطوم، الجزائر، تونس، طرابلس، الرباط، جدة، الإسكندرية، طنطا، المنصورة، أسيوط، أسوان، الأقصر، مرسى مطروح، العين السخنة، شرم الشيخ، الغردقة، الدمام، الخبر، المدينة المنورة، مكة، أبها، جيزان، نيوم، حائل، بريدة، مسقط، المنامة، صلالة، كوالالمبور، بانكوك، سنغافورة، نيويورك، واشنطن، لندن، باريس، برلين، أمستردام، روما، ميلان، مدريد",
    "devices": "أجهزة",
    "devicesList": "موبايل، لابتوب، كمبيوتر، تابلت، تلفزيون، ساعة ذكية، ماوس، كيبورد، طابعة، سماعة، راوتر، كاميرا، بروجكتور، جهاز ألعاب، بلايستيشن، إكس بوكس، نظام صوت، سخان كهربائي، مروحة، مكيف، ثلاجة، غسالة، ميكروويف، خلاط، عصارة، محضر طعام، مكنسة كهربائية، فرن كهربائي، غلاية، دفاية، مسجل، جهاز دي في دي، ريسيفر، جهاز إنذار، موبايل ألعاب، لابتوب ألعاب، قرص صلب، ذاكرة فلاش، مودم، لوحة أم، كارت شاشة، معالج، باور سبلاي، جهاز كشف المعادن، جهاز بصمة، جهاز عرض، جهاز تتبع، ساعة رياضية، سماعة رأس، جهاز تحليل السكر",
    "tools": "أدوات",
    "toolsList": "مفتاح ربط، مفك، شاكوش، كماشة، منشار، زرادية، متر، شنيور، دريل، صاروخ، بنسة، مفتاح بلدي، مفتاح فرنساوي، مفتاح ألن، مفتاح عجل، مفتاح مواسير، مقص، قطر، قلم رصاص، قلم فلوماستر، مسطرة، مثلث، فرجار، ميزان مياه، ميزان حرارة، ميزان، فأس، إزميل، سكين، ساطور، مقشطة، مقص صاج، مسدس شمع، مسدس سيليكون، مسدس رش، مسدس هواء، كاوية لحام، مكواة، كريك، مجرفة، مسطرين، فرشاة، بكرة، شريط لحام، شريط كهرباء، شريط قياس، مسامير، صواميل، براغي، شفرة، شفرة حلاقة، شفرة منشار، مفتاح صواميل",
    "videoGames": "ألعاب",
    "videoGamesList": "ببجي، فورتنايت، كول أوف ديوتي، فيفا، إي فوتبول، جي تي أي، ريد ديد، ماينكرافت، ذا ويتشر، ذا ليجند أوف زيلدا، أنشارتد، لاست أوف أس، جاد أوف وار، هورايزون زيرو دون، سبيس فيرس، باتل فيلد، أساسنز كريد، فار كراي، ووتش دوجز، سايبر بانك، ديابلو، هالو، سوبر ماريو، سونيك، بوكيمون، دونكي كونغ، تكن، ستريت فايتر، مورتال كومبات، كينغدوم هارتس، فاينل فانتسي، تومب رايدر، هاري بوتر، ستار فيلد، سبايدر مان، باتمان، جوست أوف تسوشيما، نينجا غايدن، ريزدنت إيفل، سايلنت هيل، ديمونز سولز، دارك سولز، بلادبورن، إلدن رينج، دووم، ولفنشتاين، كراش بانديكوت، سبيس إنجنيرز، ستاردو فالي، جينشين إمباكت، ليج أوف ليجيندز، أوفرواتش، فالورانت، فورتزا هورايزون",
    "cartoon": "كرتون",
    "cartoonList": "توم وجيري، سبونج بوب، ميكي ماوس، بطوط، الآنسة منشن، السنافر، بوكيمون، بن تن، مغامرات سليل، عالم غامبول المدهش، فتيات القوة، مغامرات فلاب جاك، أبطال التايتنز، ساموراي جاك، أسطورة كورا، آفاتار آخر مسخر هواء، الدببة الثلاثة، غرافيتي فولز، ستيفن يونيفرس، مغامرات وقت المغامرة، منزل فوستر، العم جدو، مختبر دكستر، جوني برافو، حياة روكو الحديثة، مغامرات بيلي وماندي، باغز باني، لوني تونز، المحقق كونان، سلام دانك، دراغون بول، ناروتو، ون بيس، الهجوم على العمالقة، ديمون سلاير، جوجو، سيف النار، مغامرات ساندوكان، رحلة عنابة، بوليانا، السيدة الصغيرة، جورجي، لحن الحياة، صاحب الظل الطويل، عهد الأصدقاء، فادي بائع الحليب، كابتن ماجد، سندريلا، سنو وايت، الجميلة النائمة، ليلو وستيتش، موانا",
    "drinks": "مشروبات",
    "drinksList": "عصير برتقال، عصير تفاح، عصير ليمون، عصير فراولة، عصير مانجو، عصير رمان، عصير عنب، عصير أناناس، عصير جوافة، عصير قصب، عصير جزر، عصير طماطم، عصير كوكتيل، ميلك شيك، سموذي، قهوة، قهوة تركية، إسبرسو، كابتشينو، لاتيه، موكا، شاي، شاي أخضر، شاي بالنعناع، كركديه، ينسون، نعناع، قرفة، جنزبيل، حليب، حليب بالشوكولاتة، لبن، لبن رايب، زبادي، آيس كوفي، هوت شوكليت، كاكاو، مشروب غازي، كولا، بيبسي، سبرايت، فانتا، مياه معدنية، مياه فوارة، مشروب طاقة، مشروب رياضي، عرقسوس، تمر هندي، سحلب، خروب، دوم",
    "random": "عشوائي",
    "randomList": "جيتار، بيانو، كمان، طبول، مزمار، ناي، قيثارة، بوق، ساكسفون، أكورديون، أورغ، بيانو كهربائي، فلوت، آلة موسيقية، لحن، نوتة موسيقية، أغنية، أوبرا، سيمفونية، بيتهوفن، موزارت، باخ، مايكل جاكسون، فيلم، ممثل، ممثلة، مخرج، سينما، مسرح، مسرحية، رواية، كتاب، قصة، شعر، شاعر، أدب، لغة، كلمة، جملة، خطاب، مقال، معلومة، فكرة، حكمة، مثل، قول، مثل شعبي، حقيقة، خيال، وهم، حلم، واقع، ماضي، حاضر، مستقبل، يوم، ليلة، ساعة، دقيقة، ثانية، شهر، سنة، فصل، شتاء، صيف، خريف، ربيع، سماء، أرض، نجمة، سحابة، رياح، مطر، ثلج، رعد، برق، شمس، قمر، كوكب، مجرة، كون، فضاء، علم، رياضيات، فيزياء، كيمياء، أحياء، تاريخ، جغرافيا، فن، رسم، نحت، عمارة، تصميم، طبخ، خياطة، نجارة، سباحة، مشي، ركض، قفز، رقص، سباق، بطولة، كأس، ميدالية، جائزة، عمل، شغل، وظيفة، مهنة، هواية، حب، صداقة، عائلة، طفل، شخص، إنسان",
    "jobs": "وظائف",
    "jobsList": "طبيب، مهندس، مدرس، محامي، محاسب، صحفي، مبرمج، مصمم، فنان، طباخ، نجار، حداد، كهربائي، سباك، ميكانيكي، سائق، طيار، مضيف طيران، شرطي، جندي، رجل إطفاء، مزارع، فلاح، بستاني، صياد، بحار، طاهي، خباز، جزار، بقال، خياط، حلاق، عامل نظافة، بناء، مهندس معماري، مهندس مدني، مهندس كهرباء، طبيب أسنان، صيدلاني، ممرض، ممرضة، مدرس ابتدائي، مدرس ثانوي، أستاذ جامعي، مدير، مشرف، مندوب مبيعات، موظف استقبال، محاسب قانوني، كاتب، سكرتير"
}