// GENERATED CODE - DO NOT MODIFY BY HAND
import 'package:flutter/material.dart';
import 'package:intl/intl.dart';
import 'intl/messages_all.dart';

// **************************************************************************
// Generator: Flutter Intl IDE plugin
// Made by Localizely
// **************************************************************************

// ignore_for_file: non_constant_identifier_names, lines_longer_than_80_chars
// ignore_for_file: join_return_with_assignment, prefer_final_in_for_each
// ignore_for_file: avoid_redundant_argument_values, avoid_escaping_inner_quotes

class S {
  S();

  static S? _current;

  static S get current {
    assert(
      _current != null,
      'No instance of S was loaded. Try to initialize the S delegate before accessing S.current.',
    );
    return _current!;
  }

  static const AppLocalizationDelegate delegate = AppLocalizationDelegate();

  static Future<S> load(Locale locale) {
    final name = (locale.countryCode?.isEmpty ?? false)
        ? locale.languageCode
        : locale.toString();
    final localeName = Intl.canonicalizedLocale(name);
    return initializeMessages(localeName).then((_) {
      Intl.defaultLocale = localeName;
      final instance = S();
      S._current = instance;

      return instance;
    });
  }

  static S of(BuildContext context) {
    final instance = S.maybeOf(context);
    assert(
      instance != null,
      'No instance of S present in the widget tree. Did you add S.delegate in localizationsDelegates?',
    );
    return instance!;
  }

  static S? maybeOf(BuildContext context) {
    return Localizations.of<S>(context, S);
  }

  /// `المستخبي`
  String get appBarTitle {
    return Intl.message('المستخبي', name: 'appBarTitle', desc: '', args: []);
  }

  /// `بدأ`
  String get start {
    return Intl.message('بدأ', name: 'start', desc: '', args: []);
  }

  /// `فكرة اللعبة`
  String get gameIdea {
    return Intl.message('فكرة اللعبة', name: 'gameIdea', desc: '', args: []);
  }

  /// `فكرة اللعبة باختصار أن لما الجيم يبدأ الموبايل بيمر على كل لاعب وكل اللاعبين بيطلعلهم كلمة واحدة عدا لاعب واحد بيطلعله حاجة مختلفة وكل اللاعبين بيحاولوا يطلعوا مين المستخبي ده وهو بيحاول يندمج معاهم ويخلي محدش يشك فيه`
  String get gameDescription {
    return Intl.message(
      'فكرة اللعبة باختصار أن لما الجيم يبدأ الموبايل بيمر على كل لاعب وكل اللاعبين بيطلعلهم كلمة واحدة عدا لاعب واحد بيطلعله حاجة مختلفة وكل اللاعبين بيحاولوا يطلعوا مين المستخبي ده وهو بيحاول يندمج معاهم ويخلي محدش يشك فيه',
      name: 'gameDescription',
      desc: '',
      args: [],
    );
  }

  /// `اختار المود`
  String get selectMode {
    return Intl.message('اختار المود', name: 'selectMode', desc: '', args: []);
  }

  /// `اختار`
  String get select {
    return Intl.message('اختار', name: 'select', desc: '', args: []);
  }

  /// `العادي`
  String get normalModeTitle {
    return Intl.message('العادي', name: 'normalModeTitle', desc: '', args: []);
  }

  /// `اللي بيظهر للمستخبي هو \n( أنت المستخبي )\n  يعني بيكون عارف إنه هو المستخبي وبيحاول يندمج`
  String get normalModeDescription {
    return Intl.message(
      'اللي بيظهر للمستخبي هو \n( أنت المستخبي )\n  يعني بيكون عارف إنه هو المستخبي وبيحاول يندمج',
      name: 'normalModeDescription',
      desc: '',
      args: [],
    );
  }

  /// `العمياني`
  String get blindModeTitle {
    return Intl.message('العمياني', name: 'blindModeTitle', desc: '', args: []);
  }

  /// `فالمود ده اللي بيظهر للمستخبي هي كلمة مختلفة عن الباقي. يعني محدش بيكون عارف إنه هو المستخبي ولا لأ`
  String get blindModeDescription {
    return Intl.message(
      'فالمود ده اللي بيظهر للمستخبي هي كلمة مختلفة عن الباقي. يعني محدش بيكون عارف إنه هو المستخبي ولا لأ',
      name: 'blindModeDescription',
      desc: '',
      args: [],
    );
  }

  /// `اضافة لاعب جديد`
  String get addPlayer {
    return Intl.message(
      'اضافة لاعب جديد',
      name: 'addPlayer',
      desc: '',
      args: [],
    );
  }

  /// `اكلات`
  String get food {
    return Intl.message('اكلات', name: 'food', desc: '', args: []);
  }

  /// `كشري, محشي, ملوخية, شاورما, بيتزا, برجر, فول, طعمية, كبسة, مقلوبة, مشاوي, كباب, كفتة, سمك, جمبري, سوشي, شوربة عدس, فطير مشلتت, عيش باللحم, بطاطس محمرة, فراخ مشوية, بانيه, مكرونة بشاميل, صينية بطاطس, رز معمر, عكاوي, بامية, مسقعة, بيض, جبنة, عصير مانجو, عصير فراولة, لبن رايب, مهلبية, أرز باللبن, كنافة, قطايف, جلاش, بلح الشام, بسبوسة, تشيز كيك, دونات, كيك, تورتة, كريم كراميل, كرواسون, باتيه, سمبوسك, سبرنج رول`
  String get foodList {
    return Intl.message(
      'كشري, محشي, ملوخية, شاورما, بيتزا, برجر, فول, طعمية, كبسة, مقلوبة, مشاوي, كباب, كفتة, سمك, جمبري, سوشي, شوربة عدس, فطير مشلتت, عيش باللحم, بطاطس محمرة, فراخ مشوية, بانيه, مكرونة بشاميل, صينية بطاطس, رز معمر, عكاوي, بامية, مسقعة, بيض, جبنة, عصير مانجو, عصير فراولة, لبن رايب, مهلبية, أرز باللبن, كنافة, قطايف, جلاش, بلح الشام, بسبوسة, تشيز كيك, دونات, كيك, تورتة, كريم كراميل, كرواسون, باتيه, سمبوسك, سبرنج رول',
      name: 'foodList',
      desc: '',
      args: [],
    );
  }

  /// `ملابس`
  String get cloths {
    return Intl.message('ملابس', name: 'cloths', desc: '', args: []);
  }

  /// `قميص, بنطلون, تيشيرت, جاكيت, بلوفر, شورت, بدلة, فستان, تنورة, عباية, كوفية, طاقية, شراب, حزام, حذاء, شبشب, سروال, بيجامة, قميص نوم, نقاب, طرحة, بدي, جاكت جينز, هودي, بالطو, قميص رسمي, تي شيرت بولو, بنطلون جينز, بنطلون قماش, تي شيرت سبورت, شوز جلد, كعب عالي, سنيكرز, بوت, فروه, بدلة رسمية, تيشيرت بكم, تيشيرت نص كم, جاكت جلد, تريننج, تيشيرت مطبوع, تيشيرت, جاكت شتوي, كاب, جوانتي, روب حمام, سروال داخلي`
  String get clothsList {
    return Intl.message(
      'قميص, بنطلون, تيشيرت, جاكيت, بلوفر, شورت, بدلة, فستان, تنورة, عباية, كوفية, طاقية, شراب, حزام, حذاء, شبشب, سروال, بيجامة, قميص نوم, نقاب, طرحة, بدي, جاكت جينز, هودي, بالطو, قميص رسمي, تي شيرت بولو, بنطلون جينز, بنطلون قماش, تي شيرت سبورت, شوز جلد, كعب عالي, سنيكرز, بوت, فروه, بدلة رسمية, تيشيرت بكم, تيشيرت نص كم, جاكت جلد, تريننج, تيشيرت مطبوع, تيشيرت, جاكت شتوي, كاب, جوانتي, روب حمام, سروال داخلي',
      name: 'clothsList',
      desc: '',
      args: [],
    );
  }

  /// `حيوانات`
  String get animals {
    return Intl.message('حيوانات', name: 'animals', desc: '', args: []);
  }

  /// `أسد, نمر, فهد, ذئب, كلب, قط, دب, ثعلب, زرافة, فيل, غزال, ظبي, تمساح, سلحفاة, أرنب, قرد, دلفين, حوت, قرش, بطريق, نسر, صقر, بومة, غراب, عصفور, كناري, ببغاء, هدهد, نملة, نحلة, ذبابة, بعوضة, جمل, حصان, حمار, بقرة, ماعز, خروف, ديك, دجاجة, بط, وزة, سمكة, نجم البحر, قنديل البحر, حصان البحر, عقرب, حية, ضفدع, ورل`
  String get animalsList {
    return Intl.message(
      'أسد, نمر, فهد, ذئب, كلب, قط, دب, ثعلب, زرافة, فيل, غزال, ظبي, تمساح, سلحفاة, أرنب, قرد, دلفين, حوت, قرش, بطريق, نسر, صقر, بومة, غراب, عصفور, كناري, ببغاء, هدهد, نملة, نحلة, ذبابة, بعوضة, جمل, حصان, حمار, بقرة, ماعز, خروف, ديك, دجاجة, بط, وزة, سمكة, نجم البحر, قنديل البحر, حصان البحر, عقرب, حية, ضفدع, ورل',
      name: 'animalsList',
      desc: '',
      args: [],
    );
  }

  /// `بلدان`
  String get countries {
    return Intl.message('بلدان', name: 'countries', desc: '', args: []);
  }

  /// `مصر, السعودية, الإمارات, الكويت, قطر, الأردن, سوريا, لبنان, فلسطين, العراق, ليبيا, تونس, الجزائر, المغرب, اليمن, البحرين, عمان, السودان, تركيا, إيران, الهند, باكستان, الصين, اليابان, كوريا, فرنسا, ألمانيا, إيطاليا, إسبانيا, البرتغال, هولندا, بلجيكا, السويد, النرويج, فنلندا, سويسرا, أمريكا, كندا, المكسيك, البرازيل, الأرجنتين, أستراليا, نيوزيلندا, جنوب أفريقيا, نيجيريا, كينيا, أوغندا, ماليزيا, إندونيسيا, تايلاند`
  String get countriesList {
    return Intl.message(
      'مصر, السعودية, الإمارات, الكويت, قطر, الأردن, سوريا, لبنان, فلسطين, العراق, ليبيا, تونس, الجزائر, المغرب, اليمن, البحرين, عمان, السودان, تركيا, إيران, الهند, باكستان, الصين, اليابان, كوريا, فرنسا, ألمانيا, إيطاليا, إسبانيا, البرتغال, هولندا, بلجيكا, السويد, النرويج, فنلندا, سويسرا, أمريكا, كندا, المكسيك, البرازيل, الأرجنتين, أستراليا, نيوزيلندا, جنوب أفريقيا, نيجيريا, كينيا, أوغندا, ماليزيا, إندونيسيا, تايلاند',
      name: 'countriesList',
      desc: '',
      args: [],
    );
  }

  /// `الوان`
  String get colors {
    return Intl.message('الوان', name: 'colors', desc: '', args: []);
  }

  /// `أحمر, أزرق, أخضر, أصفر, برتقالي, بنفسجي, وردي, أسود, أبيض, رمادي, بني, سماوي, كحلي, زيتي, تركواز, موف, أوف وايت, بيج, فضي, ذهبي, ليموني, فوشيا, نحاسي, رصاصي, كريمي, عنابي, نبيتي, مشمشي, خردلي, تيفاني, زيتي غامق, أخضر فستقي, أزرق ملكي, بنفسجي فاتح, أزرق سماوي, أصفر ليموني, رمادي غامق, رمادي فاتح, بيج رملي, عسلي, موكا, برونزي, ورد بلدي, بنفسج غامق, كشمير, أخضر زيتي, مشمع, أوف وايت مائل للرمادي, رمادي مائل للأزرق, رمادي مائل للأخضر`
  String get colorsList {
    return Intl.message(
      'أحمر, أزرق, أخضر, أصفر, برتقالي, بنفسجي, وردي, أسود, أبيض, رمادي, بني, سماوي, كحلي, زيتي, تركواز, موف, أوف وايت, بيج, فضي, ذهبي, ليموني, فوشيا, نحاسي, رصاصي, كريمي, عنابي, نبيتي, مشمشي, خردلي, تيفاني, زيتي غامق, أخضر فستقي, أزرق ملكي, بنفسجي فاتح, أزرق سماوي, أصفر ليموني, رمادي غامق, رمادي فاتح, بيج رملي, عسلي, موكا, برونزي, ورد بلدي, بنفسج غامق, كشمير, أخضر زيتي, مشمع, أوف وايت مائل للرمادي, رمادي مائل للأزرق, رمادي مائل للأخضر',
      name: 'colorsList',
      desc: '',
      args: [],
    );
  }

  /// `مسلسلات`
  String get movies {
    return Intl.message('مسلسلات', name: 'movies', desc: '', args: []);
  }

  /// `تيتانيك, أفاتار, بداية, بين النجوم, العراب, المصارع, فارس الظلام, الجوكر, خيال رخيص, نادي القتال, فورست جامب, الماتريكس, الخلاص من شاوشانك, المنتقمون, الرجل الحديدي, الرجل العنكبوت, النمر الأسود, دكتور سترينج, ملكة الثلج, حكاية لعبة, فوق, كوكو, موانا, سيارات, العثور على نيمو, الملك الأسد, علاء الدين, الجميلة والوحش, الخارقون, شريك, مدغشقر, زوتوبيا, راتاتوي, من الداخل للخارج, صداع الكحول, السعي للسعادة, ديدبول, لوغان, جون ويك, قراصنة الكاريبي, العائد, لا لا لاند, المفكرة, الشفق, ألعاب الجوع, مختلفة, الآن تراني, العظمة, تينيت`
  String get moviesList {
    return Intl.message(
      'تيتانيك, أفاتار, بداية, بين النجوم, العراب, المصارع, فارس الظلام, الجوكر, خيال رخيص, نادي القتال, فورست جامب, الماتريكس, الخلاص من شاوشانك, المنتقمون, الرجل الحديدي, الرجل العنكبوت, النمر الأسود, دكتور سترينج, ملكة الثلج, حكاية لعبة, فوق, كوكو, موانا, سيارات, العثور على نيمو, الملك الأسد, علاء الدين, الجميلة والوحش, الخارقون, شريك, مدغشقر, زوتوبيا, راتاتوي, من الداخل للخارج, صداع الكحول, السعي للسعادة, ديدبول, لوغان, جون ويك, قراصنة الكاريبي, العائد, لا لا لاند, المفكرة, الشفق, ألعاب الجوع, مختلفة, الآن تراني, العظمة, تينيت',
      name: 'moviesList',
      desc: '',
      args: [],
    );
  }

  /// `رياضات`
  String get sports {
    return Intl.message('رياضات', name: 'sports', desc: '', args: []);
  }

  /// `كرة القدم, كرة السلة, كرة الطائرة, كرة اليد, السباحة, التنس, كرة الطاولة, الكاراتيه, الجودو, المصارعة, الملاكمة, رفع الأثقال, ألعاب القوى, الجمباز, الهوكي, الرغبي, البيسبول, الكريكت, الاسكواش, البولينج, ركوب الخيل, ركوب الدراجات, القفز بالمظلات, التزحلق على الجليد, الغوص, التجديف, التزحلق على الماء, الباركور, الكونغ فو, التايكوندو, ركوب الأمواج, السباق, الفورمولا واحد, الرماية, الشطرنج, الدراجات الجبلية, اليوغا, الجمباز الإيقاعي, الزومبا, بيلاتس, الرماية بالقوس, السنوكر, الكيك بوكسنج, الهوكي الجليدي, السباحة التوقيعية, البولو, التنس الأرضي, المشي الرياضي, الركض, الرماية بالبندقية`
  String get sportsList {
    return Intl.message(
      'كرة القدم, كرة السلة, كرة الطائرة, كرة اليد, السباحة, التنس, كرة الطاولة, الكاراتيه, الجودو, المصارعة, الملاكمة, رفع الأثقال, ألعاب القوى, الجمباز, الهوكي, الرغبي, البيسبول, الكريكت, الاسكواش, البولينج, ركوب الخيل, ركوب الدراجات, القفز بالمظلات, التزحلق على الجليد, الغوص, التجديف, التزحلق على الماء, الباركور, الكونغ فو, التايكوندو, ركوب الأمواج, السباق, الفورمولا واحد, الرماية, الشطرنج, الدراجات الجبلية, اليوغا, الجمباز الإيقاعي, الزومبا, بيلاتس, الرماية بالقوس, السنوكر, الكيك بوكسنج, الهوكي الجليدي, السباحة التوقيعية, البولو, التنس الأرضي, المشي الرياضي, الركض, الرماية بالبندقية',
      name: 'sportsList',
      desc: '',
      args: [],
    );
  }

  /// `لاعبين كره`
  String get footballPlayers {
    return Intl.message(
      'لاعبين كره',
      name: 'footballPlayers',
      desc: '',
      args: [],
    );
  }

  /// `ميسي, رونالدو, نيمار, محمد صلاح, هازارد, لوكا مودريتش, كريم بنزيما, كيفين دي بروين, روبرت ليفاندوفسكي, إيرلينغ هالاند, كيليان مبابي, أنطوان غريزمان, لويس سواريز, أنخيل دي ماريا, فرينكي دي يونغ, جورجينيو, كايل ووكر, تياجو سيلفا, فينيسيوس جونيور, أشرف حكيمي, رياض محرز, إيدرسون, أليسون بيكر, تير شتيغن, دوناروما, سيرجيو راموس, جيرارد بيكيه, رافاييل فاران, خوسيه خيمينيز, ماركينيوس, بوكايو ساكا, جود بيلينغهام, كاسيميرو, برونو فيرنانديز, سانشو, سون هيونغ مين, أوباميانغ, لاكازيت, إيكاردي, باولو ديبالا, جريليش, كانتي, ديكلان رايس, رامي بن سبعيني, سفيان أمرابط, زياش, يوسف النصيري, سيرجيو بوسكيتس, إنييستا, تشافي`
  String get footballPlayersList {
    return Intl.message(
      'ميسي, رونالدو, نيمار, محمد صلاح, هازارد, لوكا مودريتش, كريم بنزيما, كيفين دي بروين, روبرت ليفاندوفسكي, إيرلينغ هالاند, كيليان مبابي, أنطوان غريزمان, لويس سواريز, أنخيل دي ماريا, فرينكي دي يونغ, جورجينيو, كايل ووكر, تياجو سيلفا, فينيسيوس جونيور, أشرف حكيمي, رياض محرز, إيدرسون, أليسون بيكر, تير شتيغن, دوناروما, سيرجيو راموس, جيرارد بيكيه, رافاييل فاران, خوسيه خيمينيز, ماركينيوس, بوكايو ساكا, جود بيلينغهام, كاسيميرو, برونو فيرنانديز, سانشو, سون هيونغ مين, أوباميانغ, لاكازيت, إيكاردي, باولو ديبالا, جريليش, كانتي, ديكلان رايس, رامي بن سبعيني, سفيان أمرابط, زياش, يوسف النصيري, سيرجيو بوسكيتس, إنييستا, تشافي',
      name: 'footballPlayersList',
      desc: '',
      args: [],
    );
  }

  /// `مدن`
  String get cities {
    return Intl.message('مدن', name: 'cities', desc: '', args: []);
  }

  /// `القاهرة, الرياض, دبي, الدوحة, بيروت, عمان, دمشق, بغداد, الخرطوم, الجزائر, تونس, طرابلس, الرباط, جدة, الإسكندرية, طنطا, المنصورة, أسيوط, أسوان, الأقصر, مرسى مطروح, العين السخنة, شرم الشيخ, الغردقة, الدمام, الخبر, المدينة المنورة, مكة, المدينة, أبها, جيزان, نيوم, حائل, بريدة, مسقط, المنامة, صلالة, كوالالمبور, بانكوك, سنغافورة, نيويورك, واشنطن, لندن, باريس, برلين, أمستردام, روما, ميلان, مدريد`
  String get citiesList {
    return Intl.message(
      'القاهرة, الرياض, دبي, الدوحة, بيروت, عمان, دمشق, بغداد, الخرطوم, الجزائر, تونس, طرابلس, الرباط, جدة, الإسكندرية, طنطا, المنصورة, أسيوط, أسوان, الأقصر, مرسى مطروح, العين السخنة, شرم الشيخ, الغردقة, الدمام, الخبر, المدينة المنورة, مكة, المدينة, أبها, جيزان, نيوم, حائل, بريدة, مسقط, المنامة, صلالة, كوالالمبور, بانكوك, سنغافورة, نيويورك, واشنطن, لندن, باريس, برلين, أمستردام, روما, ميلان, مدريد',
      name: 'citiesList',
      desc: '',
      args: [],
    );
  }

  /// `اجهزه`
  String get devices {
    return Intl.message('اجهزه', name: 'devices', desc: '', args: []);
  }

  /// `موبايل, لابتوب, كمبيوتر, تابلت, تلفزيون, ساعة ذكية, ماوس, كيبورد, طابعة, سماعة, راوتر, كاميرا, بروجكتور, جهاز ألعاب, بلايستيشن, اكس بوكس, نظام صوت, سخان كهربائي, مروحة, مكيف, ثلاجة, غسالة, ميكروويف, خلاط, عصارة, محضر طعام, مكنسة كهربائية, فرن كهربائي, غلاية, دفاية, مسجل, جهاز دي في دي, ريسيفر, جهاز انذار, موبايل جيمينج, لابتوب جيمينج, قرص صلب, ذاكرة فلاش, مودم, لوحة أم, كارت شاشة, معالج, باور سبلاي, جهاز كشف المعادن, جهاز بصمة, جهاز عرض, جهاز تتبع, ساعة رياضية, سماعة رأس, جهاز تحليل السكر`
  String get devicesList {
    return Intl.message(
      'موبايل, لابتوب, كمبيوتر, تابلت, تلفزيون, ساعة ذكية, ماوس, كيبورد, طابعة, سماعة, راوتر, كاميرا, بروجكتور, جهاز ألعاب, بلايستيشن, اكس بوكس, نظام صوت, سخان كهربائي, مروحة, مكيف, ثلاجة, غسالة, ميكروويف, خلاط, عصارة, محضر طعام, مكنسة كهربائية, فرن كهربائي, غلاية, دفاية, مسجل, جهاز دي في دي, ريسيفر, جهاز انذار, موبايل جيمينج, لابتوب جيمينج, قرص صلب, ذاكرة فلاش, مودم, لوحة أم, كارت شاشة, معالج, باور سبلاي, جهاز كشف المعادن, جهاز بصمة, جهاز عرض, جهاز تتبع, ساعة رياضية, سماعة رأس, جهاز تحليل السكر',
      name: 'devicesList',
      desc: '',
      args: [],
    );
  }

  /// `ادوات`
  String get tools {
    return Intl.message('ادوات', name: 'tools', desc: '', args: []);
  }

  /// `مفتاح ربط, مفك, شاكوش, كماشة, منشار, زرادية, متر, شنيور, دريل, صاروخ, بنسة, مفتاح بلدي, مفتاح فرنساوي, مفتاح ألن, مفتاح عجل, مفتاح مواسير, مقص, قطر, قلم رصاص, قلم فلوماستر, مسطرة, مثلث, فرجار, ميزان مياه, ميزان حرارة, ميزان, فأس, إزميل, سكينة, سكين, ساطور, مقشطة, مقص صاج, مسدس شمع, مسدس سيليكون, مسدس رش, مسدس هواء, كاوية لحام, مكواه, مكواه لحام, مكواة, كريك, مجرفة, مسطرين, فرشة, بكرة, شريط لحام, شريط كهرباء, شريط قياس, مسامير, صواميل, براغي, شفرة, شفرة حلاقة, شفرة منشار, مفتاح صواميل`
  String get toolsList {
    return Intl.message(
      'مفتاح ربط, مفك, شاكوش, كماشة, منشار, زرادية, متر, شنيور, دريل, صاروخ, بنسة, مفتاح بلدي, مفتاح فرنساوي, مفتاح ألن, مفتاح عجل, مفتاح مواسير, مقص, قطر, قلم رصاص, قلم فلوماستر, مسطرة, مثلث, فرجار, ميزان مياه, ميزان حرارة, ميزان, فأس, إزميل, سكينة, سكين, ساطور, مقشطة, مقص صاج, مسدس شمع, مسدس سيليكون, مسدس رش, مسدس هواء, كاوية لحام, مكواه, مكواه لحام, مكواة, كريك, مجرفة, مسطرين, فرشة, بكرة, شريط لحام, شريط كهرباء, شريط قياس, مسامير, صواميل, براغي, شفرة, شفرة حلاقة, شفرة منشار, مفتاح صواميل',
      name: 'toolsList',
      desc: '',
      args: [],
    );
  }

  /// `العاب`
  String get videoGames {
    return Intl.message('العاب', name: 'videoGames', desc: '', args: []);
  }

  /// `ببجي, فورتنايت, كول أوف ديوتي, فيفا, إي فوتبول, جي تي أي, ريد ديد, مايندكرافت, ذا ويتشر, ذا ليجند أوف زيلدا, أنشارتد, لاست أوف أس, جاد أوف وار, هورايزون زيرو دون, سبيس فيرس, باتل فيلد, أسسنز كريد, فار كراي, ووتش دوجز, سايبر بانك, ديابلو, هالو, سوبر ماريو, سونيك, بوكيمون, دونكي كونغ, تكن, ستريت فايتر, مورتال كومبات, كينغدوم هارتس, فاينل فانتسي, تومب رايدر, هاري بوتر, ستارفيلد, سبايدرمان, باتمان, جوست أوف تسوشيما, نينجا غايدن, ريزدنت إيفل, سايلنت هيل, ديمونز سولز, دارك سولز, بلادبورن, إلدن رينج, دووم, ولفنشتاين, كراش بانديكوت, سبيس إنجنيرز, ستاردو فالي, جينشين إمباكت, ليج أوف ليجيندز, أوفرواتش, فالورانت, فورتزا هورايزون`
  String get videoGamesList {
    return Intl.message(
      'ببجي, فورتنايت, كول أوف ديوتي, فيفا, إي فوتبول, جي تي أي, ريد ديد, مايندكرافت, ذا ويتشر, ذا ليجند أوف زيلدا, أنشارتد, لاست أوف أس, جاد أوف وار, هورايزون زيرو دون, سبيس فيرس, باتل فيلد, أسسنز كريد, فار كراي, ووتش دوجز, سايبر بانك, ديابلو, هالو, سوبر ماريو, سونيك, بوكيمون, دونكي كونغ, تكن, ستريت فايتر, مورتال كومبات, كينغدوم هارتس, فاينل فانتسي, تومب رايدر, هاري بوتر, ستارفيلد, سبايدرمان, باتمان, جوست أوف تسوشيما, نينجا غايدن, ريزدنت إيفل, سايلنت هيل, ديمونز سولز, دارك سولز, بلادبورن, إلدن رينج, دووم, ولفنشتاين, كراش بانديكوت, سبيس إنجنيرز, ستاردو فالي, جينشين إمباكت, ليج أوف ليجيندز, أوفرواتش, فالورانت, فورتزا هورايزون',
      name: 'videoGamesList',
      desc: '',
      args: [],
    );
  }

  /// `كله`
  String get everything {
    return Intl.message('كله', name: 'everything', desc: '', args: []);
  }

  /// `موبايل, لابتوب, كشري, محشي, ملوخية, قميص, بنطلون, تيشيرت, أسد, نمر, فهد, مصر, السعودية, الإمارات, أحمر, أزرق, أخضر, تيتانيك, أفاتار, بداية, كرة القدم, كرة السلة, كرة الطائرة, مفتاح ربط, مفك, شاكوش, ببجي, فورتنايت, كول أوف ديوتي, شاورما, بيتزا, برجر, جاكيت, بلوفر, شورت, ذئب, كلب, قط, الكويت, قطر, الأردن, أصفر, برتقالي, بنفسجي, العراب, المصارع, فارس الظلام, السباحة, التنس, كرة الطاولة, كماشة, منشار, زرادية, فيفا, إي فوتبول, جي تي أي, فول, طعمية, كبسة, بدلة, فستان, تنورة, دب, ثعلب, زرافة, سوريا, لبنان, فلسطين, وردي, أسود, أبيض, الخلاص من شاوشانك, المنتقمون, الرجل الحديدي, الكاراتيه, الجودو, المصارعة, متر, شنيور, دريل, ريد ديد, مايندكرافت, ذا ويتشر, مقلوبة, مشاوي, كباب, عباية, كوفية, طاقية, فيل, غزال, ظبي, العراق, ليبيا, تونس, رمادي, بني, سماوي, ملكة الثلج, حكاية لعبة, فوق, الملاكمة, رفع الأثقال, ألعاب القوى, بنسة, مفتاح بلدي, مفتاح فرنساوي, ذا ليجند أوف زيلدا, أنشارتد, سمك, جمبري, سوشي, شراب, حزام, حذاء, تمساح, سلحفاة, أرنب, الجزائر, المغرب, اليمن, كحلي, زيتي, تركواز, السعي للسعادة, ديدبول, لوغان, الجمباز, الهوكي, الرغبي, لاست أوف أس, جاد أوف وار, شوربة عدس, فطير مشلتت, عيش باللحم, شبشب, سروال, بيجامة, قرد, دلفين, حوت, البحرين, عمان, السودان, موف, أوف وايت, بيج, قراصنة الكاريبي, العائد, لا لا لاند, البيسبول, الكريكت, الاسكواش, هورايزون زيرو دون, سبيس فيرس, بطاطس محمرة, فراخ مشوية, بانيه, قميص نوم, نقاب, طرحة, قرش, بطريق, نسر, تركيا, إيران, الهند, فضي, ذهبي, ليموني, المفكرة, الشفق, ألعاب الجوع, البولينج, ركوب الخيل, ركوب الدراجات, باتل فيلد, أسسنز كريد, فار كراي, مكرونة بشاميل, صينية بطاطس, رز معمر, بدي, جاكت جينز, هودي, صقر, بومة, غراب, باكستان, الصين, اليابان, فوشيا, نحاسي, رصاصي, القفز بالمظلات, التزحلق على الجليد, الغوص, ووتش دوجز, سايبر بانك, ديابلو, عكاوي, بامية, مسقعة, بالطو, قميص رسمي, تي شيرت بولو, عصفور, كناري, ببغاء, كوريا, فرنسا, ألمانيا, كريمي, عنابي, نبيتي, التجديف, التزحلق على الماء, الباركور, ماء, هواء, نار, تراب, شمس, قمر, سماء, نجم, مطر, ثلج, سحاب, ريح, برق, رعد, موج, رمل, جبل, بحر, نهر, شجرة, زهرة, ورق, قلم, كتاب, مكتب, كرسي, طاولة, باب, شباك, حائط, أرض, سقف, لمبة, تليفون, راديو, ساعة, مرآة, كوب, طبق, ملعقة, شوكة, سكين, سلة, صندوق, مفتاح, قفل, حبل, خيط, إبرة, مقص, زر, إطار, صورة, لوحة, زجاج, بلاستيك, حديد, خشب, حجر, معدن`
  String get everythingList {
    return Intl.message(
      'موبايل, لابتوب, كشري, محشي, ملوخية, قميص, بنطلون, تيشيرت, أسد, نمر, فهد, مصر, السعودية, الإمارات, أحمر, أزرق, أخضر, تيتانيك, أفاتار, بداية, كرة القدم, كرة السلة, كرة الطائرة, مفتاح ربط, مفك, شاكوش, ببجي, فورتنايت, كول أوف ديوتي, شاورما, بيتزا, برجر, جاكيت, بلوفر, شورت, ذئب, كلب, قط, الكويت, قطر, الأردن, أصفر, برتقالي, بنفسجي, العراب, المصارع, فارس الظلام, السباحة, التنس, كرة الطاولة, كماشة, منشار, زرادية, فيفا, إي فوتبول, جي تي أي, فول, طعمية, كبسة, بدلة, فستان, تنورة, دب, ثعلب, زرافة, سوريا, لبنان, فلسطين, وردي, أسود, أبيض, الخلاص من شاوشانك, المنتقمون, الرجل الحديدي, الكاراتيه, الجودو, المصارعة, متر, شنيور, دريل, ريد ديد, مايندكرافت, ذا ويتشر, مقلوبة, مشاوي, كباب, عباية, كوفية, طاقية, فيل, غزال, ظبي, العراق, ليبيا, تونس, رمادي, بني, سماوي, ملكة الثلج, حكاية لعبة, فوق, الملاكمة, رفع الأثقال, ألعاب القوى, بنسة, مفتاح بلدي, مفتاح فرنساوي, ذا ليجند أوف زيلدا, أنشارتد, سمك, جمبري, سوشي, شراب, حزام, حذاء, تمساح, سلحفاة, أرنب, الجزائر, المغرب, اليمن, كحلي, زيتي, تركواز, السعي للسعادة, ديدبول, لوغان, الجمباز, الهوكي, الرغبي, لاست أوف أس, جاد أوف وار, شوربة عدس, فطير مشلتت, عيش باللحم, شبشب, سروال, بيجامة, قرد, دلفين, حوت, البحرين, عمان, السودان, موف, أوف وايت, بيج, قراصنة الكاريبي, العائد, لا لا لاند, البيسبول, الكريكت, الاسكواش, هورايزون زيرو دون, سبيس فيرس, بطاطس محمرة, فراخ مشوية, بانيه, قميص نوم, نقاب, طرحة, قرش, بطريق, نسر, تركيا, إيران, الهند, فضي, ذهبي, ليموني, المفكرة, الشفق, ألعاب الجوع, البولينج, ركوب الخيل, ركوب الدراجات, باتل فيلد, أسسنز كريد, فار كراي, مكرونة بشاميل, صينية بطاطس, رز معمر, بدي, جاكت جينز, هودي, صقر, بومة, غراب, باكستان, الصين, اليابان, فوشيا, نحاسي, رصاصي, القفز بالمظلات, التزحلق على الجليد, الغوص, ووتش دوجز, سايبر بانك, ديابلو, عكاوي, بامية, مسقعة, بالطو, قميص رسمي, تي شيرت بولو, عصفور, كناري, ببغاء, كوريا, فرنسا, ألمانيا, كريمي, عنابي, نبيتي, التجديف, التزحلق على الماء, الباركور, ماء, هواء, نار, تراب, شمس, قمر, سماء, نجم, مطر, ثلج, سحاب, ريح, برق, رعد, موج, رمل, جبل, بحر, نهر, شجرة, زهرة, ورق, قلم, كتاب, مكتب, كرسي, طاولة, باب, شباك, حائط, أرض, سقف, لمبة, تليفون, راديو, ساعة, مرآة, كوب, طبق, ملعقة, شوكة, سكين, سلة, صندوق, مفتاح, قفل, حبل, خيط, إبرة, مقص, زر, إطار, صورة, لوحة, زجاج, بلاستيك, حديد, خشب, حجر, معدن',
      name: 'everythingList',
      desc: '',
      args: [],
    );
  }
}

class AppLocalizationDelegate extends LocalizationsDelegate<S> {
  const AppLocalizationDelegate();

  List<Locale> get supportedLocales {
    return const <Locale>[
      Locale.fromSubtags(languageCode: 'en'),
      Locale.fromSubtags(languageCode: 'ar'),
    ];
  }

  @override
  bool isSupported(Locale locale) => _isSupported(locale);
  @override
  Future<S> load(Locale locale) => S.load(locale);
  @override
  bool shouldReload(AppLocalizationDelegate old) => false;

  bool _isSupported(Locale locale) {
    for (var supportedLocale in supportedLocales) {
      if (supportedLocale.languageCode == locale.languageCode) {
        return true;
      }
    }
    return false;
  }
}
