Repository: mohamedazzam36/the_spy
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appBarTitle
source: The Spy
ar: المستخبي

source: Start
ar: بدأ

source: Game Idea
ar: فكرة اللعبة

# gameDescription
source: The idea is simple: when the game starts, the phone is passed to each player. All players see the same word—except one, who sees something different. The goal is for the odd one out to blend in without getting caught, while the others try to figure out who the spy is.
ar: فكرة اللعبة باختصار أن لما الجيم يبدأ الموبايل بيمر على كل لاعب وكل اللاعبين بيطلعلهم كلمة واحدة عدا لاعب واحد بيطلعله حاجة مختلفة وكل اللاعبين بيحاولوا يطلعوا مين المستخبي ده وهو بيحاول يندمج معاهم ويخلي محدش يشك فيه

source: Select mode
ar: اختار المود

source: Select
ar: اختار

# normalModeTitle
source: Normal Mode
ar: العادي

# normalModeDescription
source: The spy sees this message: (You are the spy) In this mode, the spy knows their identity and tries to blend in with the others.
ar: اللي بيظهر للمستخبي هو ( أنت المستخبي ) يعني بيكون عارف إنه هو المستخبي وبيحاول يندمج

# blindModeTitle
source: Blind Mode
ar: العمياني

# blindModeDescription
source: In this mode, the spy sees a completely different word—but doesn’t know they’re the spy. No one knows who the spy is—not even the spy themselves.
ar: فالمود ده اللي بيظهر للمستخبي هي كلمة مختلفة عن الباقي. يعني محدش بيكون عارف إنه هو المستخبي ولا لأ
